---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexLine.#ctor(System.Int32,System.Int32)
source: html/9bb32483-bf85-e9a8-f7cf-75dd6906b1f9.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexLine.#ctor Method

Constructs the line segment primitive.

## Syntax (C#)
```csharp
public IndexLine(
	int index0,
	int index1
)
```

## Parameters
- **index0** (`System.Int32`) - The index of the line segment's first vertex.
- **index1** (`System.Int32`) - The index of the line segment's second vertex.